{
  "people": [
    {
      "id": 1,
      "name": "Prof. Jessica Starling",
      "image": "Jessica.jpg",
      "title": "Professor from Lewis and Clark College in Portland, OR",
      "background": "Jessie Starling joined the faculty of Lewis & Clark in 2013 after completing a postdoctoral fellowship in Japanese Buddhism at the University of California, Berkeley.  She is also affiliated with the Asian Studies and Gender Studies programs at Lewis & Clark, and teaches classes on Asian religions, religion and gender, and ethnographic research methods."
    },
    {
      "id": 2,
      "name": "Kemi Nakabayashi",
      "image": "Kemi.jpg",
      "title": "Member and Musician of Seattle Betsuin Buddhist Temple",
      "background": "Service music coordinator at Seattle Betsuin and editor of the Sing Namo Amida Butsu gatha book"
    },
    {
      "id": 3,
      "name": "Rev. Don Castro",
      "image": "revcastro.jpg",
      "title": "Reverend of Seattle Betsuin Buddhist Temple",
      "background": "Rev. Castro was raised in Santa Clara, California and graduated with a B.A. in Anthropology from San Jose State Univ.  Following his graduation from IBS in Berkeley, he received Tokudo and Kyoshi in Japan and assumed his ministerial duties at the San Francisco Buddhist Church in 1977.  In 1981, he was transferred to Enmanji and, in 1986 he assumed his position at Seattle Betsuin.  He retired as Rinban at the end of 2016 but continues to stay active both in Seattle and lecturing on EcoSangha at other temples and events.  He is married to Rev. Shuri Saigusa and since his retirement, he has become a grandfather to three grandchildren.  He continues to study the Yabunouchi way of tea ceremony and was privileged to serve tea to the Gomonshu when he visited last year."
    },
    {
      "id": 4,
      "name": "Seattle Young Adult Youth Minister's Assistant",
      "image": "SeattleYAMA.jpg",
      "title": "Minister Assistant of Seattle Betsuin Buddhist Temple",
      "background": "The Seattle YAMA program is a continuation of Buddhist education for college age students in the Seattle area, many of whom come from temples throughout the United States. The Seattle YAMA’s are alumni of the Buddhist Churches of America’s YAC program. "
    },
    {
      "id": 5,
      "name": "Rev. Jim Warrick",
      "image": "RevWarrick.jpg",
      "title": "Reverend of White River Buddhist Temple",
      "background": "Resident Minister at White River Buddhist Temple. Warrick Sensei is a native of North Carolina. After serving in the US Air Force in electronics, he furthered his Electronics education at Bossier College in Louisiana. After working for 40 years in Biomedical Engineering for General Electric, he retired in 2014. After he and wife, Rona, traveled extensively, they found that they would like to spend time now spreading the Nembutsu teaching."
    },
    {
      "id": 6,
      "name": "Ayano Kusunoki and Kaori Miyaji",
      "image": "AyanoandKaori.jpg",
      "title": "Member of Seattle Betsuin Buddhist Temple and Wife of Rev. Katsuya Kusunoki",
      "background": "Ayano and Kaori, wives of Reverend Katsuya Kusunoki and Takashi Miyaji, have both started successful youth playgroups at their respective temples. They value the idea of having young people involved at the temple and have worked hard to support programs that do the same."
    },
    {
      "id": 7,
      "name": "Rev. Anan Hatanaka",
      "image": "Hatanaka.jpg",
      "title": "Reverend of Hongwanji International Office",
      "background": "My name is Anan Hatanaka. I was born in Fukui prefecture. I work at the Hongwanji Office at Jodo shinshu Center, Berkeley as the Program Assistant. 福井県出身の畑中阿難と申します。バークレー浄土真宗センターの本願寺オフィスで、プログラムアシスタントとして勤務しております。"
    },
    {
      "id": 8,
      "name": "Rev. Fred Pelger",
      "image": "Fred.jpg",
      "title": "Reverend Fred Pelger",
      "background": "Temple member for 20 years\nTokudo ordination in 2012, Kyoto Japan\n69 years old\nMarried to my same gender husband, Les Hitsman, 2014 and partners for the past 37 years. Taught dharma school several years but now letting someone else have the joy of that. Enjoy speaking to the sangha members any chance I get. Love leading the service when Rev. Miyaji can't be there."
    },
    {
      "id": 9,
      "name": "Prof. James Dobbins",
      "image": "james_dobbins.jpg",
      "title": "Professor of Oberlin College in Oberlin, OH",
      "background": "Oberlin College, 1983-2019 Fairchild Professor of Religion and East Asian Studies Chair, Religion Department, 1996-1998, 2004-2005 Director, East Asian Studies Program, 1991, 1993-1996 Courses Taught: Introduction to Religion, Colloquium on Buddhism, First-year Seminar on Taoism, Chinese Thought and Religion, Japanese Thought and Religion, Zen Buddhism, Seminar on Taoism, Seminar on Mahāyāna Buddhism, Seminar on Pure Land Buddhism, Seminar on Buddhism and Orientalism"
    },
    {
      "id": 10,
      "name": "Rev. Sala Sekiya",
      "image": "revsala.jpg",
      "title": "Reverend of Gardena Buddhist Temple",
      "background": "Reverend Sala Sekiya is a BCA Kaikyoshi Minister at the Gardena Buddhist Church from March 2017. Born and raised in Tokyo, Japan, Rev. Sekiya finished high school in the USA and has a BS from Boston University. Sensei was ordained in 2012 and continued on her education in Hongwanji-ha schools in Kyoto, Japan, prior to transferring to the Buddhist Churches of America and being assigned to the Seattle Betsuin Buddhist Temple from Sep 2015 to Feb 2017. She has finished the Hongwanji-ha Rituals courses and is a Hongwanji-ha certified Special Rituals Minister."
    },
    {
      "id": 11,
      "name": "Rev. Irene Goto and Minister's Assistants Leonora Clarke, Meya Stout, and Devon Matsumoto",
      "image": "SeattleMA.jpg",
      "title": "Reverend and some MAs from Seattle Betsuin Buddhist Temple",
      "background": "Irene Goto, Reverend of Seattle Betsuin Buddhist Temple:\nA certified Minister’s Assistant in the summer of 2011 and received Tokudo* ordination in 2014. \"Through high school I attended a Christian church because there was no Buddhist temple near our home. In the mid 80’s when my daughter was in kindergarten she asked me to take her to this place called \"church\" so I decided to take her to the Buddhist Church. I was pleasantly surprised to find that what the ministers at Seattle Betsuin were teaching resonated with my views. I’ve been attending, participating, and listening ever since. I hope to help keep the Dharma resonating.\" \n\nLeonora Clarke, Minister's Assisant of Seattle Betsuin Buddhist Temple:\nA certified minister’s assistant in the fall of 2013. She has a degree in Comparative Religions and has completed the two year Jodo Shinshu Correspondence Course offered by the BCA’s Jodo Shinshu Center. Leonora works for the University of Washington School of Medicine.\n\nMeya Stout, Minister's Assistant of Seattle Betsuin Buddhist Temple:\nMeya was a transplant from the Las Vegas Buddhist Sangha. Meya became a Minister’s Assistant at the Seattle Betsuin in January of 2020.\n\nDevon Matsumoto, Minister's Assistant of Seattle Betsuin Buddhist Temple:\nDevon Matsumoto is enrolled in Seattle University’s graduate program and is working on his Master’s of Social Work. He became a Minister’s Assistant at the Seattle Betsuin in January of 2020."
    },
    {
      "id": 12,
      "name": " Rev. Diana Thompson, Rev. Yuki Sugahara, Crystal Inge, and Diane Deaver",
      "image": "ParentsPanel.jpg",
      "title": "Buddhist Parenting Panelists",
      "background": "Reverend Diana Thompson: Reverend\n\nYuki Sugahara, Reverend of Oregon Buddhist Temple:\nResident Minister of Oregon Buddhist Temple. He was born as a son of temple families in Shiromane prefecture. He received Tokudo in 1996, Kyoshi in 2002,  and Kaikyoshi in 2011. In choosing three words to describe him, he chose \"Beer, Buddhism and Bass Guitar\".\n\nCrystal Inge:\nMember and Former President of Tacoma Buddhist Temnple\n\nDiane Deaver, Member of Seattle Betsuin Buddhist Temple:\nOberlin College, 1983-2019 Fairchild Professor of Religion and East Asian Studies Chair, Religion Department, 1996-1998, 2004-2005 Director, East Asian Studies Program, 1991, 1993-1996 Courses Taught: Introduction to Religion, Colloquium on Buddhism, First-year Seminar on Taoism, Chinese Thought and Religion, Japanese Thought and Religion, Zen Buddhism, Seminar on Taoism, Seminar on Mahāyāna Buddhism, Seminar on Pure Land Buddhism, Seminar on Buddhism and Orientalism"
    },
    {
      "id": 13,
      "name": "Tom Ikeda",
      "image": "TomIkeda.jpg",
      "title": "Executive Director of Densho",
      "background": "Tom Ikeda is the founding Executive Director of Densho, a non-profit organization started in 1996. Densho’s mission is to preserve and share the history of the WWII Japanese American incarceration to promote justice and equity today. Tom is a sansei who was born and raised in Seattle. He has personally conducted more than 250 video-recorded oral history interviews with Japanese Americans. Over the past 24 years, the Densho archives have grown to include some 80,000 scanned photos and documents, as well as nearly 1,000 oral history interviews with Japanese American who were incarcerated during World War II. Densho’s Encyclopedia provides 1,500 articles giving context to the content. And, through free online lessons for educators, Densho's curriculum introduces students to questions of civil liberties through stories and first hand accounts of discrimination. All of Densho’s resources can be freely accessed and downloaded by anyone, anywhere."
    },
    {
      "id": 14,
      "name": "Rev. Nariaki Hayashi, Rev. Yugo Fujita, and Rev. Yushi Mukojima",
      "image": "Dharmathon.jpg",
      "title": "Reverends for Dharmathon",
      "background": "Nariaki Hayashi, Reverend of Ekoji Buddhist Temple:\nCame from Kyoto, Japan as a minister for the Ekoji Buddhist Temple to share and spread Shinran Shonin’s; the founder of our tradition, Shin Buddhism teaching here in America. I was born in Hawaii, so I guess that makes me a Nisei; the second generation. I moved back to Japan when I was 12. I come from a temple family with roots in Kagoshima, Japan.\n\nYugo Fujita, Reverend of Salinas Buddhist Temple:\nRev Fujita is the resident of Salinas Buddhist Temple. He studied English in Seattle for two years in the Seattle area. He became a BCA Minister in October of 2016. Salinas Buddhist Temple is his first assignment and he enjoys playing basketball in his free time.\n\nYushi, Reverend of Mountain View Buddhist Temple:\nReverend Mukojima has been the resident minister of the Mountain View Buddhist Temple since August 1st, 2013. He began his career with the Buddhist Churches of America (BCA) in November 2001. He was assigned as the resident minister to the Seabrook Buddhist Temple in New Jersey in March of 2002."
    },
    {
      "id": 15,
      "name": "Rev. Ryuta Furumoto, Rev. Kazuaki Nakata, and Rev. Melissa Opel",
      "image": "TokudoPanel.jpg",
      "title": "Road to Tokudo Reverend Speakers",
      "background": "Ryuta Furumoto, Reverend of Senshin Buddhist Temple:\n1998 Graduated Ryukoku University (Buddhist Studies)　龍谷大学仏教学卒業\n1998 Hongwanji Gonshiki, Hiroshima Bukkyo Gakuin　勤式指導所、広島仏教学院\n1999 Hongwanji Dendo-in, 伝道院\n1999 Hilo Betsuin, Hawaii　ヒロ別院\n2001 Arizona Buddhist Temple　アリゾナ仏教会\n2009 San Mateo Buddhist Temple　サンマテオ仏教会\n2013 Senshin Buddhist Temple 洗心仏教会\nWheel of Dharma Japanese editor 法輪、日本語編集\nBuddhist Surfers' Association, President 仏教徒サーフィン連盟 会長\n\nKazuaki Nakata, Reverend of Fresno Buddhist Temple:\nPresent Central California District Minister\nPhD Candidate in Buddhist Studies\nResearch Assistant in Marketing and Public Relation\n\nPast\nCounty Chaplain, Hospital Chaplain, Campus Chaplain\n\nEducation\nBA in Jodo Shinshu Studies\nMA in Buddhist Studies\nMBA in Public Administration\n\nMelissa Opel, Reverend / Minister's Assistant:\nMinister’s Assistant at Spokane Buddhist Temple, Received Tokudo Ordination in 2019"
    },
    {
      "id": 16,
      "name": "Prof./MA Erik Hammerstrom and Rev. Takashi Miyaji",
      "image": "MiyajiandErik.jpg",
      "title": "Dana for World Peace Speakers",
      "background": "Erik Hammerstrom, Professor of Religious Studies and Minister's Assistant of Tacoma Buddhist Temple:\nErik previously acted as a speaker at a NW District Convention on the topic of the Millennial Generation.\nPh.D., Religious Studies, Indiana University, 2010\nM.A., Religion (Asian), University of Hawai'i, 2003\nB.A., Sarah Lawrence College, 1997\n\nTakashi Miyaji, Reverend of Tacoma Buddhist Temple:\nRev. Takashi Miyaji has been a minister of the Tacoma Buddhist Temple since December of 2017. He grew up in Los Angeles, California. He has graduated from the University of California at Berkeley with a Bachelor’s Degree in Philosophy and Japanese language and literature, Institute of Buddhist Studies at Berkeley, California with a Master’s in Buddhist Studies, Ryukoku University in Kyoto, Japan with a Master’s Degree in Shin Buddhist Studies, and completed the doctoral coursework at Ryukoku University. He specializes in the areas of Japanese Buddhism and religion, translation of Buddhist scripture, and Jodo Shinshu doctrine and ethics. He received his doctorate from the Humanities Department at Ryukoku University, specializing in Shin Buddhist Studies."
    },
    {
      "id": 17,
      "name": "Rev. Dr. David Matsumoto, Rev. Dr. Mutsumi Fujiwara Wondra, and Rev. Dr. Takashi Miyaji",
      "image" : "wisteria.jpg",
      "title": "IBS & CBE Symposium Speakers",
      "background": "Speakers for Symposium."
    }
  ]
}
